DataProcessors/ОбменСИнтернетМагазином.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ОбменСИнтернетМагазином</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/CMSИнтернетМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>CMSИнтернетМагазина</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Bitrix</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОбменСИнтернетМагазином/Forms/ФормаСпискаСтатусов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиПодключения = Параметры.НастройкиПодключения;
	
	CMSИнтернетМагазина = НастройкиПодключения.CMSИнтернетМагазина;
	
	Элементы.ФормаЗагрузитьИзИнтернетМагазина.Видимость = 
		CMSИнтернетМагазина = ПредопределенноеЗначение("Перечисление.CMSИнтернетМагазина.Bitrix")
			ИЛИ CMSИнтернетМагазина = ПредопределенноеЗначение("Перечисление.CMSИнтернетМагазина.UMI");
	
	Статусы.ЗагрузитьЗначения(Параметры.Статусы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть(Статусы.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзИнтернетМагазина(Команда)
	СтатусыЗаказов = ОбменСИнтернетМагазиномВызовСервера.СтатусыЗаказовИнтернетМагазина(НастройкиПодключения);
	Если ЗначениеЗаполнено(СтатусыЗаказов) Тогда
		Статусы.ЗагрузитьЗначения(СтатусыЗаказов);
		Элементы.Статусы.Обновить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
